# 1. while 루플르 사용하여 처음 10 개의 자연수 인쇄
예상출력)
0
1
2
3
4
5
6
7
8
9
10




# 2. 다음 패턴 인쇄
예상출력)
1 
1 2 
1 2 3 
12 34 
12 34 5



# 3. 사용자로부터 숫자를 받아 1과 주어진 숫자 사이의 모든 숫자의 합을 계산합니다.
사용자에게 10 이 주어졌으므로 출력은 55가 되어야합니다.



# 4. 주어진 숫자의 곱셈표 인쇄
예를 들어 num = 2출력은
2
4
6
8
10
12
14
16
18
20



# 5. 주어진 목록을 반복하고 5로 나눌 수있는 숫자를 표시하고 150보다 큰 숫자를 찾으면 루프 반복을 중지합니다.
list1 = [12, 15, 32, 42, 55, 75, 122, 132, 150, 180, 200]
예상출력)
15
55
75
150



# 6. 주어진 숫자가 주어진 숫자의 총 자릿수
예를 들어 숫자는 75869 이므로 출력은 5 여야합니다 .



# 7.  for 루프를 사용하여 다음 패턴 인쇄
5 4 3 2 1 
4 3 2 1 
3 2 1 
2 1 
1



# 8. for 루프를 사용하여 다음 목록을 뒤집습니다.
list1 = [10, 20, 30, 40, 50]



# 9. for 루프를 사용하여 -10에서 -1 표시



# 10. for 루프를 성공적으로 실행 한 후 "Done"메시지 표시
예를 들어, 다음 루프는 오류없이 실행됩니다.
범위 (5)에있는 i :
    인쇄 (i)

따라서 예상 출력은 다음과 같아야합니다.
0
1
2
3
4
끝난!